

http://dnd5eapi.co

* Lists                                         :verb:
template https://dnd5eapi.co/api/
Accept: application/json

** Spells                                      :verb:

#+begin_src verb :op send
get spells
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Server: Cowboy
Report-To: {"group":"heroku-nel","max_age":3600,"endpoints":[{"url":"https://nel.heroku.com/reports?ts=1733972547&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=GX%2FrWfZGOI53wthoxyliN10K5uC%2F4U5LxIiabe16y2c%3D"}]}
Reporting-Endpoints: heroku-nel=https://nel.heroku.com/reports?ts=1733972547&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=GX%2FrWfZGOI53wthoxyliN10K5uC%2F4U5LxIiabe16y2c%3D
Nel: {"report_to":"heroku-nel","max_age":3600,"success_fraction":0.005,"failure_fraction":0.05,"response_headers":["Via"]}
Connection: keep-alive
X-Powered-By: Express
Access-Control-Allow-Origin: *
X-Ratelimit-Limit: 50
X-Ratelimit-Remaining: 49
Date: Thu, 12 Dec 2024 03:02:27 GMT
X-Ratelimit-Reset: 1733972549
Content-Type: application/json; charset=utf-8
Content-Length: 28867
Etag: W/"70c3-i+tfWPru5s6kZlcYJE+F2vbTehs"
Via: 1.1 vegur

{
  "count": 319,
  "results": [
    {
      "index": "acid-arrow",
      "name": "Acid Arrow",
      "level": 2,
      "url": "/api/spells/acid-arrow"
    },
    {
      "index": "acid-splash",
      "name": "Acid Splash",
      "level": 0,
      "url": "/api/spells/acid-splash"
    },
    {
      "index": "aid",
      "name": "Aid",
      "level": 2,
      "url": "/api/spells/aid"
    },
    {
      "index": "alarm",
      "name": "Alarm",
      "level": 1,
      "url": "/api/spells/alarm"
    },
    {
      "index": "alter-self",
      "name": "Alter Self",
      "level": 2,
      "url": "/api/spells/alter-self"
    },
    {
      "index": "animal-friendship",
      "name": "Animal Friendship",
      "level": 1,
      "url": "/api/spells/animal-friendship"
    },
    {
      "index": "animal-messenger",
      "name": "Animal Messenger",
      "level": 2,
      "url": "/api/spells/animal-messenger"
    },
    {
      "index": "animal-shapes",
      "name": "Animal Shapes",
      "level": 8,
      "url": "/api/spells/animal-shapes"
    },
    {
      "index": "animate-dead",
      "name": "Animate Dead",
      "level": 3,
      "url": "/api/spells/animate-dead"
    },
    {
      "index": "animate-objects",
      "name": "Animate Objects",
      "level": 5,
      "url": "/api/spells/animate-objects"
    },
    {
      "index": "antilife-shell",
      "name": "Antilife Shell",
      "level": 5,
      "url": "/api/spells/antilife-shell"
    },
    {
      "index": "antimagic-field",
      "name": "Antimagic Field",
      "level": 8,
      "url": "/api/spells/antimagic-field"
    },
    {
      "index": "antipathy-sympathy",
      "name": "Antipathy/Sympathy",
      "level": 8,
      "url": "/api/spells/antipathy-sympathy"
    },
    {
      "index": "arcane-eye",
      "name": "Arcane Eye",
      "level": 4,
      "url": "/api/spells/arcane-eye"
    },
    {
      "index": "arcane-hand",
      "name": "Arcane Hand",
      "level": 5,
      "url": "/api/spells/arcane-hand"
    },
    {
      "index": "arcane-lock",
      "name": "Arcane Lock",
      "level": 2,
      "url": "/api/spells/arcane-lock"
    },
    {
      "index": "arcane-sword",
      "name": "Arcane Sword",
      "level": 7,
      "url": "/api/spells/arcane-sword"
    },
    {
      "index": "arcanists-magic-aura",
      "name": "Arcanist's Magic Aura",
      "level": 2,
      "url": "/api/spells/arcanists-magic-aura"
    },
    {
      "index": "astral-projection",
      "name": "Astral Projection",
      "level": 9,
      "url": "/api/spells/astral-projection"
    },
    {
      "index": "augury",
      "name": "Augury",
      "level": 2,
      "url": "/api/spells/augury"
    },
    {
      "index": "awaken",
      "name": "Awaken",
      "level": 5,
      "url": "/api/spells/awaken"
    },
    {
      "index": "bane",
      "name": "Bane",
      "level": 1,
      "url": "/api/spells/bane"
    },
    {
      "index": "banishment",
      "name": "Banishment",
      "level": 4,
      "url": "/api/spells/banishment"
    },
    {
      "index": "barkskin",
      "name": "Barkskin",
      "level": 2,
      "url": "/api/spells/barkskin"
    },
    {
      "index": "beacon-of-hope",
      "name": "Beacon of Hope",
      "level": 3,
      "url": "/api/spells/beacon-of-hope"
    },
    {
      "index": "bestow-curse",
      "name": "Bestow Curse",
      "level": 3,
      "url": "/api/spells/bestow-curse"
    },
    {
      "index": "black-tentacles",
      "name": "Black Tentacles",
      "level": 4,
      "url": "/api/spells/black-tentacles"
    },
    {
      "index": "blade-barrier",
      "name": "Blade Barrier",
      "level": 6,
      "url": "/api/spells/blade-barrier"
    },
    {
      "index": "bless",
      "name": "Bless",
      "level": 1,
      "url": "/api/spells/bless"
    },
    {
      "index": "blight",
      "name": "Blight",
      "level": 4,
      "url": "/api/spells/blight"
    },
    {
      "index": "blindness-deafness",
      "name": "Blindness/Deafness",
      "level": 2,
      "url": "/api/spells/blindness-deafness"
    },
    {
      "index": "blink",
      "name": "Blink",
      "level": 3,
      "url": "/api/spells/blink"
    },
    {
      "index": "blur",
      "name": "Blur",
      "level": 2,
      "url": "/api/spells/blur"
    },
    {
      "index": "branding-smite",
      "name": "Branding Smite",
      "level": 2,
      "url": "/api/spells/branding-smite"
    },
    {
      "index": "burning-hands",
      "name": "Burning Hands",
      "level": 1,
      "url": "/api/spells/burning-hands"
    },
    {
      "index": "call-lightning",
      "name": "Call Lightning",
      "level": 3,
      "url": "/api/spells/call-lightning"
    },
    {
      "index": "calm-emotions",
      "name": "Calm Emotions",
      "level": 2,
      "url": "/api/spells/calm-emotions"
    },
    {
      "index": "chain-lightning",
      "name": "Chain Lightning",
      "level": 6,
      "url": "/api/spells/chain-lightning"
    },
    {
      "index": "charm-person",
      "name": "Charm Person",
      "level": 1,
      "url": "/api/spells/charm-person"
    },
    {
      "index": "chill-touch",
      "name": "Chill Touch",
      "level": 0,
      "url": "/api/spells/chill-touch"
    },
    {
      "index": "circle-of-death",
      "name": "Circle of Death",
      "level": 6,
      "url": "/api/spells/circle-of-death"
    },
    {
      "index": "clairvoyance",
      "name": "Clairvoyance",
      "level": 3,
      "url": "/api/spells/clairvoyance"
    },
    {
      "index": "clone",
      "name": "Clone",
      "level": 8,
      "url": "/api/spells/clone"
    },
    {
      "index": "cloudkill",
      "name": "Cloudkill",
      "level": 5,
      "url": "/api/spells/cloudkill"
    },
    {
      "index": "color-spray",
      "name": "Color Spray",
      "level": 1,
      "url": "/api/spells/color-spray"
    },
    {
      "index": "command",
      "name": "Command",
      "level": 1,
      "url": "/api/spells/command"
    },
    {
      "index": "commune",
      "name": "Commune",
      "level": 5,
      "url": "/api/spells/commune"
    },
    {
      "index": "commune-with-nature",
      "name": "Commune With Nature",
      "level": 5,
      "url": "/api/spells/commune-with-nature"
    },
    {
      "index": "comprehend-languages",
      "name": "Comprehend Languages",
      "level": 1,
      "url": "/api/spells/comprehend-languages"
    },
    {
      "index": "compulsion",
      "name": "Compulsion",
      "level": 4,
      "url": "/api/spells/compulsion"
    },
    {
      "index": "cone-of-cold",
      "name": "Cone of Cold",
      "level": 5,
      "url": "/api/spells/cone-of-cold"
    },
    {
      "index": "confusion",
      "name": "Confusion",
      "level": 4,
      "url": "/api/spells/confusion"
    },
    {
      "index": "conjure-animals",
      "name": "Conjure Animals",
      "level": 3,
      "url": "/api/spells/conjure-animals"
    },
    {
      "index": "conjure-celestial",
      "name": "Conjure Celestial",
      "level": 7,
      "url": "/api/spells/conjure-celestial"
    },
    {
      "index": "conjure-elemental",
      "name": "Conjure Elemental",
      "level": 5,
      "url": "/api/spells/conjure-elemental"
    },
    {
      "index": "conjure-fey",
      "name": "Conjure Fey",
      "level": 6,
      "url": "/api/spells/conjure-fey"
    },
    {
      "index": "conjure-minor-elementals",
      "name": "Conjure Minor Elementals",
      "level": 4,
      "url": "/api/spells/conjure-minor-elementals"
    },
    {
      "index": "conjure-woodland-beings",
      "name": "Conjure Woodland Beings",
      "level": 4,
      "url": "/api/spells/conjure-woodland-beings"
    },
    {
      "index": "contact-other-plane",
      "name": "Contact Other Plane",
      "level": 5,
      "url": "/api/spells/contact-other-plane"
    },
    {
      "index": "contagion",
      "name": "Contagion",
      "level": 5,
      "url": "/api/spells/contagion"
    },
    {
      "index": "contingency",
      "name": "Contingency",
      "level": 6,
      "url": "/api/spells/contingency"
    },
    {
      "index": "continual-flame",
      "name": "Continual Flame",
      "level": 2,
      "url": "/api/spells/continual-flame"
    },
    {
      "index": "control-water",
      "name": "Control Water",
      "level": 4,
      "url": "/api/spells/control-water"
    },
    {
      "index": "control-weather",
      "name": "Control Weather",
      "level": 8,
      "url": "/api/spells/control-weather"
    },
    {
      "index": "counterspell",
      "name": "Counterspell",
      "level": 3,
      "url": "/api/spells/counterspell"
    },
    {
      "index": "create-food-and-water",
      "name": "Create Food and Water",
      "level": 3,
      "url": "/api/spells/create-food-and-water"
    },
    {
      "index": "create-or-destroy-water",
      "name": "Create or Destroy Water",
      "level": 1,
      "url": "/api/spells/create-or-destroy-water"
    },
    {
      "index": "create-undead",
      "name": "Create Undead",
      "level": 6,
      "url": "/api/spells/create-undead"
    },
    {
      "index": "creation",
      "name": "Creation",
      "level": 5,
      "url": "/api/spells/creation"
    },
    {
      "index": "cure-wounds",
      "name": "Cure Wounds",
      "level": 1,
      "url": "/api/spells/cure-wounds"
    },
    {
      "index": "dancing-lights",
      "name": "Dancing Lights",
      "level": 0,
      "url": "/api/spells/dancing-lights"
    },
    {
      "index": "darkness",
      "name": "Darkness",
      "level": 2,
      "url": "/api/spells/darkness"
    },
    {
      "index": "darkvision",
      "name": "Darkvision",
      "level": 2,
      "url": "/api/spells/darkvision"
    },
    {
      "index": "daylight",
      "name": "Daylight",
      "level": 3,
      "url": "/api/spells/daylight"
    },
    {
      "index": "death-ward",
      "name": "Death Ward",
      "level": 4,
      "url": "/api/spells/death-ward"
    },
    {
      "index": "delayed-blast-fireball",
      "name": "Delayed Blast Fireball",
      "level": 7,
      "url": "/api/spells/delayed-blast-fireball"
    },
    {
      "index": "demiplane",
      "name": "Demiplane",
      "level": 8,
      "url": "/api/spells/demiplane"
    },
    {
      "index": "detect-evil-and-good",
      "name": "Detect Evil and Good",
      "level": 1,
      "url": "/api/spells/detect-evil-and-good"
    },
    {
      "index": "detect-magic",
      "name": "Detect Magic",
      "level": 1,
      "url": "/api/spells/detect-magic"
    },
    {
      "index": "detect-poison-and-disease",
      "name": "Detect Poison and Disease",
      "level": 1,
      "url": "/api/spells/detect-poison-and-disease"
    },
    {
      "index": "detect-thoughts",
      "name": "Detect Thoughts",
      "level": 2,
      "url": "/api/spells/detect-thoughts"
    },
    {
      "index": "dimension-door",
      "name": "Dimension Door",
      "level": 4,
      "url": "/api/spells/dimension-door"
    },
    {
      "index": "disguise-self",
      "name": "Disguise Self",
      "level": 1,
      "url": "/api/spells/disguise-self"
    },
    {
      "index": "disintegrate",
      "name": "Disintegrate",
      "level": 6,
      "url": "/api/spells/disintegrate"
    },
    {
      "index": "dispel-evil-and-good",
      "name": "Dispel Evil and Good",
      "level": 5,
      "url": "/api/spells/dispel-evil-and-good"
    },
    {
      "index": "dispel-magic",
      "name": "Dispel Magic",
      "level": 3,
      "url": "/api/spells/dispel-magic"
    },
    {
      "index": "divination",
      "name": "Divination",
      "level": 4,
      "url": "/api/spells/divination"
    },
    {
      "index": "divine-favor",
      "name": "Divine Favor",
      "level": 1,
      "url": "/api/spells/divine-favor"
    },
    {
      "index": "divine-word",
      "name": "Divine Word",
      "level": 7,
      "url": "/api/spells/divine-word"
    },
    {
      "index": "dominate-beast",
      "name": "Dominate Beast",
      "level": 4,
      "url": "/api/spells/dominate-beast"
    },
    {
      "index": "dominate-monster",
      "name": "Dominate Monster",
      "level": 8,
      "url": "/api/spells/dominate-monster"
    },
    {
      "index": "dominate-person",
      "name": "Dominate Person",
      "level": 5,
      "url": "/api/spells/dominate-person"
    },
    {
      "index": "dream",
      "name": "Dream",
      "level": 5,
      "url": "/api/spells/dream"
    },
    {
      "index": "druidcraft",
      "name": "Druidcraft",
      "level": 0,
      "url": "/api/spells/druidcraft"
    },
    {
      "index": "earthquake",
      "name": "Earthquake",
      "level": 8,
      "url": "/api/spells/earthquake"
    },
    {
      "index": "eldritch-blast",
      "name": "Eldritch Blast",
      "level": 0,
      "url": "/api/spells/eldritch-blast"
    },
    {
      "index": "enhance-ability",
      "name": "Enhance Ability",
      "level": 2,
      "url": "/api/spells/enhance-ability"
    },
    {
      "index": "enlarge-reduce",
      "name": "Enlarge/Reduce",
      "level": 2,
      "url": "/api/spells/enlarge-reduce"
    },
    {
      "index": "entangle",
      "name": "Entangle",
      "level": 1,
      "url": "/api/spells/entangle"
    },
    {
      "index": "enthrall",
      "name": "Enthrall",
      "level": 2,
      "url": "/api/spells/enthrall"
    },
    {
      "index": "etherealness",
      "name": "Etherealness",
      "level": 7,
      "url": "/api/spells/etherealness"
    },
    {
      "index": "expeditious-retreat",
      "name": "Expeditious Retreat",
      "level": 1,
      "url": "/api/spells/expeditious-retreat"
    },
    {
      "index": "eyebite",
      "name": "Eyebite",
      "level": 6,
      "url": "/api/spells/eyebite"
    },
    {
      "index": "fabricate",
      "name": "Fabricate",
      "level": 4,
      "url": "/api/spells/fabricate"
    },
    {
      "index": "faerie-fire",
      "name": "Faerie Fire",
      "level": 1,
      "url": "/api/spells/faerie-fire"
    },
    {
      "index": "faithful-hound",
      "name": "Faithful Hound",
      "level": 4,
      "url": "/api/spells/faithful-hound"
    },
    {
      "index": "false-life",
      "name": "False Life",
      "level": 1,
      "url": "/api/spells/false-life"
    },
    {
      "index": "fear",
      "name": "Fear",
      "level": 3,
      "url": "/api/spells/fear"
    },
    {
      "index": "feather-fall",
      "name": "Feather Fall",
      "level": 1,
      "url": "/api/spells/feather-fall"
    },
    {
      "index": "feeblemind",
      "name": "Feeblemind",
      "level": 8,
      "url": "/api/spells/feeblemind"
    },
    {
      "index": "find-familiar",
      "name": "Find Familiar",
      "level": 1,
      "url": "/api/spells/find-familiar"
    },
    {
      "index": "find-steed",
      "name": "Find Steed",
      "level": 2,
      "url": "/api/spells/find-steed"
    },
    {
      "index": "find-the-path",
      "name": "Find the Path",
      "level": 6,
      "url": "/api/spells/find-the-path"
    },
    {
      "index": "find-traps",
      "name": "Find Traps",
      "level": 2,
      "url": "/api/spells/find-traps"
    },
    {
      "index": "finger-of-death",
      "name": "Finger of Death",
      "level": 7,
      "url": "/api/spells/finger-of-death"
    },
    {
      "index": "fire-bolt",
      "name": "Fire Bolt",
      "level": 0,
      "url": "/api/spells/fire-bolt"
    },
    {
      "index": "fire-shield",
      "name": "Fire Shield",
      "level": 4,
      "url": "/api/spells/fire-shield"
    },
    {
      "index": "fire-storm",
      "name": "Fire Storm",
      "level": 7,
      "url": "/api/spells/fire-storm"
    },
    {
      "index": "fireball",
      "name": "Fireball",
      "level": 3,
      "url": "/api/spells/fireball"
    },
    {
      "index": "flame-blade",
      "name": "Flame Blade",
      "level": 2,
      "url": "/api/spells/flame-blade"
    },
    {
      "index": "flame-strike",
      "name": "Flame Strike",
      "level": 5,
      "url": "/api/spells/flame-strike"
    },
    {
      "index": "flaming-sphere",
      "name": "Flaming Sphere",
      "level": 2,
      "url": "/api/spells/flaming-sphere"
    },
    {
      "index": "flesh-to-stone",
      "name": "Flesh to Stone",
      "level": 6,
      "url": "/api/spells/flesh-to-stone"
    },
    {
      "index": "floating-disk",
      "name": "Floating Disk",
      "level": 1,
      "url": "/api/spells/floating-disk"
    },
    {
      "index": "fly",
      "name": "Fly",
      "level": 3,
      "url": "/api/spells/fly"
    },
    {
      "index": "fog-cloud",
      "name": "Fog Cloud",
      "level": 1,
      "url": "/api/spells/fog-cloud"
    },
    {
      "index": "forbiddance",
      "name": "Forbiddance",
      "level": 6,
      "url": "/api/spells/forbiddance"
    },
    {
      "index": "forcecage",
      "name": "Forcecage",
      "level": 7,
      "url": "/api/spells/forcecage"
    },
    {
      "index": "foresight",
      "name": "Foresight",
      "level": 9,
      "url": "/api/spells/foresight"
    },
    {
      "index": "freedom-of-movement",
      "name": "Freedom of Movement",
      "level": 4,
      "url": "/api/spells/freedom-of-movement"
    },
    {
      "index": "freezing-sphere",
      "name": "Freezing Sphere",
      "level": 6,
      "url": "/api/spells/freezing-sphere"
    },
    {
      "index": "gaseous-form",
      "name": "Gaseous Form",
      "level": 3,
      "url": "/api/spells/gaseous-form"
    },
    {
      "index": "gate",
      "name": "Gate",
      "level": 9,
      "url": "/api/spells/gate"
    },
    {
      "index": "geas",
      "name": "Geas",
      "level": 5,
      "url": "/api/spells/geas"
    },
    {
      "index": "gentle-repose",
      "name": "Gentle Repose",
      "level": 2,
      "url": "/api/spells/gentle-repose"
    },
    {
      "index": "giant-insect",
      "name": "Giant Insect",
      "level": 4,
      "url": "/api/spells/giant-insect"
    },
    {
      "index": "glibness",
      "name": "Glibness",
      "level": 8,
      "url": "/api/spells/glibness"
    },
    {
      "index": "globe-of-invulnerability",
      "name": "Globe of Invulnerability",
      "level": 6,
      "url": "/api/spells/globe-of-invulnerability"
    },
    {
      "index": "glyph-of-warding",
      "name": "Glyph of Warding",
      "level": 3,
      "url": "/api/spells/glyph-of-warding"
    },
    {
      "index": "goodberry",
      "name": "Goodberry",
      "level": 1,
      "url": "/api/spells/goodberry"
    },
    {
      "index": "grease",
      "name": "Grease",
      "level": 1,
      "url": "/api/spells/grease"
    },
    {
      "index": "greater-invisibility",
      "name": "Greater Invisibility",
      "level": 4,
      "url": "/api/spells/greater-invisibility"
    },
    {
      "index": "greater-restoration",
      "name": "Greater Restoration",
      "level": 5,
      "url": "/api/spells/greater-restoration"
    },
    {
      "index": "guardian-of-faith",
      "name": "Guardian of Faith",
      "level": 4,
      "url": "/api/spells/guardian-of-faith"
    },
    {
      "index": "guards-and-wards",
      "name": "Guards and Wards",
      "level": 6,
      "url": "/api/spells/guards-and-wards"
    },
    {
      "index": "guidance",
      "name": "Guidance",
      "level": 0,
      "url": "/api/spells/guidance"
    },
    {
      "index": "guiding-bolt",
      "name": "Guiding Bolt",
      "level": 1,
      "url": "/api/spells/guiding-bolt"
    },
    {
      "index": "gust-of-wind",
      "name": "Gust of Wind",
      "level": 2,
      "url": "/api/spells/gust-of-wind"
    },
    {
      "index": "hallow",
      "name": "Hallow",
      "level": 5,
      "url": "/api/spells/hallow"
    },
    {
      "index": "hallucinatory-terrain",
      "name": "Hallucinatory Terrain",
      "level": 4,
      "url": "/api/spells/hallucinatory-terrain"
    },
    {
      "index": "harm",
      "name": "Harm",
      "level": 6,
      "url": "/api/spells/harm"
    },
    {
      "index": "haste",
      "name": "Haste",
      "level": 3,
      "url": "/api/spells/haste"
    },
    {
      "index": "heal",
      "name": "Heal",
      "level": 6,
      "url": "/api/spells/heal"
    },
    {
      "index": "healing-word",
      "name": "Healing Word",
      "level": 1,
      "url": "/api/spells/healing-word"
    },
    {
      "index": "heat-metal",
      "name": "Heat Metal",
      "level": 2,
      "url": "/api/spells/heat-metal"
    },
    {
      "index": "hellish-rebuke",
      "name": "Hellish Rebuke",
      "level": 1,
      "url": "/api/spells/hellish-rebuke"
    },
    {
      "index": "heroes-feast",
      "name": "Heroes' Feast",
      "level": 6,
      "url": "/api/spells/heroes-feast"
    },
    {
      "index": "heroism",
      "name": "Heroism",
      "level": 1,
      "url": "/api/spells/heroism"
    },
    {
      "index": "hideous-laughter",
      "name": "Hideous Laughter",
      "level": 1,
      "url": "/api/spells/hideous-laughter"
    },
    {
      "index": "hold-monster",
      "name": "Hold Monster",
      "level": 5,
      "url": "/api/spells/hold-monster"
    },
    {
      "index": "hold-person",
      "name": "Hold Person",
      "level": 2,
      "url": "/api/spells/hold-person"
    },
    {
      "index": "holy-aura",
      "name": "Holy Aura",
      "level": 8,
      "url": "/api/spells/holy-aura"
    },
    {
      "index": "hunters-mark",
      "name": "Hunter's Mark",
      "level": 1,
      "url": "/api/spells/hunters-mark"
    },
    {
      "index": "hypnotic-pattern",
      "name": "Hypnotic Pattern",
      "level": 3,
      "url": "/api/spells/hypnotic-pattern"
    },
    {
      "index": "ice-storm",
      "name": "Ice Storm",
      "level": 4,
      "url": "/api/spells/ice-storm"
    },
    {
      "index": "identify",
      "name": "Identify",
      "level": 1,
      "url": "/api/spells/identify"
    },
    {
      "index": "illusory-script",
      "name": "Illusory Script",
      "level": 1,
      "url": "/api/spells/illusory-script"
    },
    {
      "index": "imprisonment",
      "name": "Imprisonment",
      "level": 9,
      "url": "/api/spells/imprisonment"
    },
    {
      "index": "incendiary-cloud",
      "name": "Incendiary Cloud",
      "level": 8,
      "url": "/api/spells/incendiary-cloud"
    },
    {
      "index": "inflict-wounds",
      "name": "Inflict Wounds",
      "level": 1,
      "url": "/api/spells/inflict-wounds"
    },
    {
      "index": "insect-plague",
      "name": "Insect Plague",
      "level": 5,
      "url": "/api/spells/insect-plague"
    },
    {
      "index": "instant-summons",
      "name": "Instant Summons",
      "level": 6,
      "url": "/api/spells/instant-summons"
    },
    {
      "index": "invisibility",
      "name": "Invisibility",
      "level": 2,
      "url": "/api/spells/invisibility"
    },
    {
      "index": "irresistible-dance",
      "name": "Irresistible Dance",
      "level": 6,
      "url": "/api/spells/irresistible-dance"
    },
    {
      "index": "jump",
      "name": "Jump",
      "level": 1,
      "url": "/api/spells/jump"
    },
    {
      "index": "knock",
      "name": "Knock",
      "level": 2,
      "url": "/api/spells/knock"
    },
    {
      "index": "legend-lore",
      "name": "Legend Lore",
      "level": 5,
      "url": "/api/spells/legend-lore"
    },
    {
      "index": "lesser-restoration",
      "name": "Lesser Restoration",
      "level": 2,
      "url": "/api/spells/lesser-restoration"
    },
    {
      "index": "levitate",
      "name": "Levitate",
      "level": 2,
      "url": "/api/spells/levitate"
    },
    {
      "index": "light",
      "name": "Light",
      "level": 0,
      "url": "/api/spells/light"
    },
    {
      "index": "lightning-bolt",
      "name": "Lightning Bolt",
      "level": 3,
      "url": "/api/spells/lightning-bolt"
    },
    {
      "index": "locate-animals-or-plants",
      "name": "Locate Animals or Plants",
      "level": 2,
      "url": "/api/spells/locate-animals-or-plants"
    },
    {
      "index": "locate-creature",
      "name": "Locate Creature",
      "level": 4,
      "url": "/api/spells/locate-creature"
    },
    {
      "index": "locate-object",
      "name": "Locate Object",
      "level": 2,
      "url": "/api/spells/locate-object"
    },
    {
      "index": "longstrider",
      "name": "Longstrider",
      "level": 1,
      "url": "/api/spells/longstrider"
    },
    {
      "index": "mage-armor",
      "name": "Mage Armor",
      "level": 1,
      "url": "/api/spells/mage-armor"
    },
    {
      "index": "mage-hand",
      "name": "Mage Hand",
      "level": 0,
      "url": "/api/spells/mage-hand"
    },
    {
      "index": "magic-circle",
      "name": "Magic Circle",
      "level": 3,
      "url": "/api/spells/magic-circle"
    },
    {
      "index": "magic-jar",
      "name": "Magic Jar",
      "level": 6,
      "url": "/api/spells/magic-jar"
    },
    {
      "index": "magic-missile",
      "name": "Magic Missile",
      "level": 1,
      "url": "/api/spells/magic-missile"
    },
    {
      "index": "magic-mouth",
      "name": "Magic Mouth",
      "level": 2,
      "url": "/api/spells/magic-mouth"
    },
    {
      "index": "magic-weapon",
      "name": "Magic Weapon",
      "level": 2,
      "url": "/api/spells/magic-weapon"
    },
    {
      "index": "magnificent-mansion",
      "name": "Magnificent Mansion",
      "level": 7,
      "url": "/api/spells/magnificent-mansion"
    },
    {
      "index": "major-image",
      "name": "Major Image",
      "level": 3,
      "url": "/api/spells/major-image"
    },
    {
      "index": "mass-cure-wounds",
      "name": "Mass Cure Wounds",
      "level": 5,
      "url": "/api/spells/mass-cure-wounds"
    },
    {
      "index": "mass-heal",
      "name": "Mass Heal",
      "level": 9,
      "url": "/api/spells/mass-heal"
    },
    {
      "index": "mass-healing-word",
      "name": "Mass Healing Word",
      "level": 3,
      "url": "/api/spells/mass-healing-word"
    },
    {
      "index": "mass-suggestion",
      "name": "Mass Suggestion",
      "level": 6,
      "url": "/api/spells/mass-suggestion"
    },
    {
      "index": "maze",
      "name": "Maze",
      "level": 8,
      "url": "/api/spells/maze"
    },
    {
      "index": "meld-into-stone",
      "name": "Meld Into Stone",
      "level": 3,
      "url": "/api/spells/meld-into-stone"
    },
    {
      "index": "mending",
      "name": "Mending",
      "level": 0,
      "url": "/api/spells/mending"
    },
    {
      "index": "message",
      "name": "Message",
      "level": 0,
      "url": "/api/spells/message"
    },
    {
      "index": "meteor-swarm",
      "name": "Meteor Swarm",
      "level": 9,
      "url": "/api/spells/meteor-swarm"
    },
    {
      "index": "mind-blank",
      "name": "Mind Blank",
      "level": 8,
      "url": "/api/spells/mind-blank"
    },
    {
      "index": "minor-illusion",
      "name": "Minor Illusion",
      "level": 0,
      "url": "/api/spells/minor-illusion"
    },
    {
      "index": "mirage-arcane",
      "name": "Mirage Arcane",
      "level": 7,
      "url": "/api/spells/mirage-arcane"
    },
    {
      "index": "mirror-image",
      "name": "Mirror Image",
      "level": 2,
      "url": "/api/spells/mirror-image"
    },
    {
      "index": "mislead",
      "name": "Mislead",
      "level": 5,
      "url": "/api/spells/mislead"
    },
    {
      "index": "misty-step",
      "name": "Misty Step",
      "level": 2,
      "url": "/api/spells/misty-step"
    },
    {
      "index": "modify-memory",
      "name": "Modify Memory",
      "level": 5,
      "url": "/api/spells/modify-memory"
    },
    {
      "index": "moonbeam",
      "name": "Moonbeam",
      "level": 2,
      "url": "/api/spells/moonbeam"
    },
    {
      "index": "move-earth",
      "name": "Move Earth",
      "level": 6,
      "url": "/api/spells/move-earth"
    },
    {
      "index": "nondetection",
      "name": "Nondetection",
      "level": 3,
      "url": "/api/spells/nondetection"
    },
    {
      "index": "pass-without-trace",
      "name": "Pass Without Trace",
      "level": 2,
      "url": "/api/spells/pass-without-trace"
    },
    {
      "index": "passwall",
      "name": "Passwall",
      "level": 5,
      "url": "/api/spells/passwall"
    },
    {
      "index": "phantasmal-killer",
      "name": "Phantasmal Killer",
      "level": 4,
      "url": "/api/spells/phantasmal-killer"
    },
    {
      "index": "phantom-steed",
      "name": "Phantom Steed",
      "level": 3,
      "url": "/api/spells/phantom-steed"
    },
    {
      "index": "planar-ally",
      "name": "Planar Ally",
      "level": 6,
      "url": "/api/spells/planar-ally"
    },
    {
      "index": "planar-binding",
      "name": "Planar Binding",
      "level": 5,
      "url": "/api/spells/planar-binding"
    },
    {
      "index": "plane-shift",
      "name": "Plane Shift",
      "level": 7,
      "url": "/api/spells/plane-shift"
    },
    {
      "index": "plant-growth",
      "name": "Plant Growth",
      "level": 3,
      "url": "/api/spells/plant-growth"
    },
    {
      "index": "poison-spray",
      "name": "Poison Spray",
      "level": 0,
      "url": "/api/spells/poison-spray"
    },
    {
      "index": "polymorph",
      "name": "Polymorph",
      "level": 4,
      "url": "/api/spells/polymorph"
    },
    {
      "index": "power-word-kill",
      "name": "Power Word Kill",
      "level": 9,
      "url": "/api/spells/power-word-kill"
    },
    {
      "index": "power-word-stun",
      "name": "Power Word Stun",
      "level": 8,
      "url": "/api/spells/power-word-stun"
    },
    {
      "index": "prayer-of-healing",
      "name": "Prayer of Healing",
      "level": 2,
      "url": "/api/spells/prayer-of-healing"
    },
    {
      "index": "prestidigitation",
      "name": "Prestidigitation",
      "level": 0,
      "url": "/api/spells/prestidigitation"
    },
    {
      "index": "prismatic-spray",
      "name": "Prismatic Spray",
      "level": 7,
      "url": "/api/spells/prismatic-spray"
    },
    {
      "index": "prismatic-wall",
      "name": "Prismatic Wall",
      "level": 9,
      "url": "/api/spells/prismatic-wall"
    },
    {
      "index": "private-sanctum",
      "name": "Private Sanctum",
      "level": 4,
      "url": "/api/spells/private-sanctum"
    },
    {
      "index": "produce-flame",
      "name": "Produce Flame",
      "level": 0,
      "url": "/api/spells/produce-flame"
    },
    {
      "index": "programmed-illusion",
      "name": "Programmed Illusion",
      "level": 6,
      "url": "/api/spells/programmed-illusion"
    },
    {
      "index": "project-image",
      "name": "Project Image",
      "level": 7,
      "url": "/api/spells/project-image"
    },
    {
      "index": "protection-from-energy",
      "name": "Protection From Energy",
      "level": 3,
      "url": "/api/spells/protection-from-energy"
    },
    {
      "index": "protection-from-evil-and-good",
      "name": "Protection from Evil and Good",
      "level": 1,
      "url": "/api/spells/protection-from-evil-and-good"
    },
    {
      "index": "protection-from-poison",
      "name": "Protection from Poison",
      "level": 2,
      "url": "/api/spells/protection-from-poison"
    },
    {
      "index": "purify-food-and-drink",
      "name": "Purify Food and Drink",
      "level": 1,
      "url": "/api/spells/purify-food-and-drink"
    },
    {
      "index": "raise-dead",
      "name": "Raise Dead",
      "level": 5,
      "url": "/api/spells/raise-dead"
    },
    {
      "index": "ray-of-enfeeblement",
      "name": "Ray of Enfeeblement",
      "level": 2,
      "url": "/api/spells/ray-of-enfeeblement"
    },
    {
      "index": "ray-of-frost",
      "name": "Ray of Frost",
      "level": 0,
      "url": "/api/spells/ray-of-frost"
    },
    {
      "index": "regenerate",
      "name": "Regenerate",
      "level": 7,
      "url": "/api/spells/regenerate"
    },
    {
      "index": "reincarnate",
      "name": "Reincarnate",
      "level": 5,
      "url": "/api/spells/reincarnate"
    },
    {
      "index": "remove-curse",
      "name": "Remove Curse",
      "level": 3,
      "url": "/api/spells/remove-curse"
    },
    {
      "index": "resilient-sphere",
      "name": "Resilient Sphere",
      "level": 4,
      "url": "/api/spells/resilient-sphere"
    },
    {
      "index": "resistance",
      "name": "Resistance",
      "level": 0,
      "url": "/api/spells/resistance"
    },
    {
      "index": "resurrection",
      "name": "Resurrection",
      "level": 7,
      "url": "/api/spells/resurrection"
    },
    {
      "index": "reverse-gravity",
      "name": "Reverse Gravity",
      "level": 7,
      "url": "/api/spells/reverse-gravity"
    },
    {
      "index": "revivify",
      "name": "Revivify",
      "level": 3,
      "url": "/api/spells/revivify"
    },
    {
      "index": "rope-trick",
      "name": "Rope Trick",
      "level": 2,
      "url": "/api/spells/rope-trick"
    },
    {
      "index": "sacred-flame",
      "name": "Sacred Flame",
      "level": 0,
      "url": "/api/spells/sacred-flame"
    },
    {
      "index": "sanctuary",
      "name": "Sanctuary",
      "level": 1,
      "url": "/api/spells/sanctuary"
    },
    {
      "index": "scorching-ray",
      "name": "Scorching Ray",
      "level": 2,
      "url": "/api/spells/scorching-ray"
    },
    {
      "index": "scrying",
      "name": "Scrying",
      "level": 5,
      "url": "/api/spells/scrying"
    },
    {
      "index": "secret-chest",
      "name": "Secret Chest",
      "level": 4,
      "url": "/api/spells/secret-chest"
    },
    {
      "index": "see-invisibility",
      "name": "See Invisibility",
      "level": 2,
      "url": "/api/spells/see-invisibility"
    },
    {
      "index": "seeming",
      "name": "Seeming",
      "level": 5,
      "url": "/api/spells/seeming"
    },
    {
      "index": "sending",
      "name": "Sending",
      "level": 3,
      "url": "/api/spells/sending"
    },
    {
      "index": "sequester",
      "name": "Sequester",
      "level": 7,
      "url": "/api/spells/sequester"
    },
    {
      "index": "shapechange",
      "name": "Shapechange",
      "level": 9,
      "url": "/api/spells/shapechange"
    },
    {
      "index": "shatter",
      "name": "Shatter",
      "level": 2,
      "url": "/api/spells/shatter"
    },
    {
      "index": "shield",
      "name": "Shield",
      "level": 1,
      "url": "/api/spells/shield"
    },
    {
      "index": "shield-of-faith",
      "name": "Shield of Faith",
      "level": 1,
      "url": "/api/spells/shield-of-faith"
    },
    {
      "index": "shillelagh",
      "name": "Shillelagh",
      "level": 0,
      "url": "/api/spells/shillelagh"
    },
    {
      "index": "shocking-grasp",
      "name": "Shocking Grasp",
      "level": 0,
      "url": "/api/spells/shocking-grasp"
    },
    {
      "index": "silence",
      "name": "Silence",
      "level": 2,
      "url": "/api/spells/silence"
    },
    {
      "index": "silent-image",
      "name": "Silent Image",
      "level": 1,
      "url": "/api/spells/silent-image"
    },
    {
      "index": "simulacrum",
      "name": "Simulacrum",
      "level": 7,
      "url": "/api/spells/simulacrum"
    },
    {
      "index": "sleep",
      "name": "Sleep",
      "level": 1,
      "url": "/api/spells/sleep"
    },
    {
      "index": "sleet-storm",
      "name": "Sleet Storm",
      "level": 3,
      "url": "/api/spells/sleet-storm"
    },
    {
      "index": "slow",
      "name": "Slow",
      "level": 3,
      "url": "/api/spells/slow"
    },
    {
      "index": "spare-the-dying",
      "name": "Spare the Dying",
      "level": 0,
      "url": "/api/spells/spare-the-dying"
    },
    {
      "index": "speak-with-animals",
      "name": "Speak with Animals",
      "level": 1,
      "url": "/api/spells/speak-with-animals"
    },
    {
      "index": "speak-with-dead",
      "name": "Speak with Dead",
      "level": 3,
      "url": "/api/spells/speak-with-dead"
    },
    {
      "index": "speak-with-plants",
      "name": "Speak with Plants",
      "level": 3,
      "url": "/api/spells/speak-with-plants"
    },
    {
      "index": "spider-climb",
      "name": "Spider Climb",
      "level": 2,
      "url": "/api/spells/spider-climb"
    },
    {
      "index": "spike-growth",
      "name": "Spike Growth",
      "level": 2,
      "url": "/api/spells/spike-growth"
    },
    {
      "index": "spirit-guardians",
      "name": "Spirit Guardians",
      "level": 3,
      "url": "/api/spells/spirit-guardians"
    },
    {
      "index": "spiritual-weapon",
      "name": "Spiritual Weapon",
      "level": 2,
      "url": "/api/spells/spiritual-weapon"
    },
    {
      "index": "stinking-cloud",
      "name": "Stinking Cloud",
      "level": 3,
      "url": "/api/spells/stinking-cloud"
    },
    {
      "index": "stone-shape",
      "name": "Stone Shape",
      "level": 4,
      "url": "/api/spells/stone-shape"
    },
    {
      "index": "stoneskin",
      "name": "Stoneskin",
      "level": 4,
      "url": "/api/spells/stoneskin"
    },
    {
      "index": "storm-of-vengeance",
      "name": "Storm of Vengeance",
      "level": 9,
      "url": "/api/spells/storm-of-vengeance"
    },
    {
      "index": "suggestion",
      "name": "Suggestion",
      "level": 2,
      "url": "/api/spells/suggestion"
    },
    {
      "index": "sunbeam",
      "name": "Sunbeam",
      "level": 6,
      "url": "/api/spells/sunbeam"
    },
    {
      "index": "sunburst",
      "name": "Sunburst",
      "level": 8,
      "url": "/api/spells/sunburst"
    },
    {
      "index": "symbol",
      "name": "Symbol",
      "level": 7,
      "url": "/api/spells/symbol"
    },
    {
      "index": "telekinesis",
      "name": "Telekinesis",
      "level": 5,
      "url": "/api/spells/telekinesis"
    },
    {
      "index": "telepathic-bond",
      "name": "Telepathic Bond",
      "level": 5,
      "url": "/api/spells/telepathic-bond"
    },
    {
      "index": "teleport",
      "name": "Teleport",
      "level": 7,
      "url": "/api/spells/teleport"
    },
    {
      "index": "teleportation-circle",
      "name": "Teleportation Circle",
      "level": 5,
      "url": "/api/spells/teleportation-circle"
    },
    {
      "index": "thaumaturgy",
      "name": "Thaumaturgy",
      "level": 0,
      "url": "/api/spells/thaumaturgy"
    },
    {
      "index": "thunderwave",
      "name": "Thunderwave",
      "level": 1,
      "url": "/api/spells/thunderwave"
    },
    {
      "index": "time-stop",
      "name": "Time Stop",
      "level": 9,
      "url": "/api/spells/time-stop"
    },
    {
      "index": "tiny-hut",
      "name": "Tiny Hut",
      "level": 3,
      "url": "/api/spells/tiny-hut"
    },
    {
      "index": "tongues",
      "name": "Tongues",
      "level": 3,
      "url": "/api/spells/tongues"
    },
    {
      "index": "transport-via-plants",
      "name": "Transport via Plants",
      "level": 6,
      "url": "/api/spells/transport-via-plants"
    },
    {
      "index": "tree-stride",
      "name": "Tree Stride",
      "level": 5,
      "url": "/api/spells/tree-stride"
    },
    {
      "index": "true-polymorph",
      "name": "True Polymorph",
      "level": 9,
      "url": "/api/spells/true-polymorph"
    },
    {
      "index": "true-resurrection",
      "name": "True Resurrection",
      "level": 9,
      "url": "/api/spells/true-resurrection"
    },
    {
      "index": "true-seeing",
      "name": "True Seeing",
      "level": 6,
      "url": "/api/spells/true-seeing"
    },
    {
      "index": "true-strike",
      "name": "True Strike",
      "level": 0,
      "url": "/api/spells/true-strike"
    },
    {
      "index": "unseen-servant",
      "name": "Unseen Servant",
      "level": 1,
      "url": "/api/spells/unseen-servant"
    },
    {
      "index": "vampiric-touch",
      "name": "Vampiric Touch",
      "level": 3,
      "url": "/api/spells/vampiric-touch"
    },
    {
      "index": "vicious-mockery",
      "name": "Vicious Mockery",
      "level": 0,
      "url": "/api/spells/vicious-mockery"
    },
    {
      "index": "wall-of-fire",
      "name": "Wall of Fire",
      "level": 4,
      "url": "/api/spells/wall-of-fire"
    },
    {
      "index": "wall-of-force",
      "name": "Wall of Force",
      "level": 5,
      "url": "/api/spells/wall-of-force"
    },
    {
      "index": "wall-of-ice",
      "name": "Wall of Ice",
      "level": 6,
      "url": "/api/spells/wall-of-ice"
    },
    {
      "index": "wall-of-stone",
      "name": "Wall of Stone",
      "level": 5,
      "url": "/api/spells/wall-of-stone"
    },
    {
      "index": "wall-of-thorns",
      "name": "Wall of Thorns",
      "level": 6,
      "url": "/api/spells/wall-of-thorns"
    },
    {
      "index": "warding-bond",
      "name": "Warding Bond",
      "level": 2,
      "url": "/api/spells/warding-bond"
    },
    {
      "index": "water-breathing",
      "name": "Water Breathing",
      "level": 3,
      "url": "/api/spells/water-breathing"
    },
    {
      "index": "water-walk",
      "name": "Water Walk",
      "level": 3,
      "url": "/api/spells/water-walk"
    },
    {
      "index": "web",
      "name": "Web",
      "level": 2,
      "url": "/api/spells/web"
    },
    {
      "index": "weird",
      "name": "Weird",
      "level": 9,
      "url": "/api/spells/weird"
    },
    {
      "index": "wind-walk",
      "name": "Wind Walk",
      "level": 6,
      "url": "/api/spells/wind-walk"
    },
    {
      "index": "wind-wall",
      "name": "Wind Wall",
      "level": 3,
      "url": "/api/spells/wind-wall"
    },
    {
      "index": "wish",
      "name": "Wish",
      "level": 9,
      "url": "/api/spells/wish"
    },
    {
      "index": "word-of-recall",
      "name": "Word of Recall",
      "level": 6,
      "url": "/api/spells/word-of-recall"
    },
    {
      "index": "zone-of-truth",
      "name": "Zone of Truth",
      "level": 2,
      "url": "/api/spells/zone-of-truth"
    }
  ]
}
#+end_example

* Spells                                        :verb:
template https://dnd5eapi.co/api/spells/
Accept: application/json

** Cleric

*** 1st level

**** Bane

#+begin_src verb :op send
get bane
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Server: Cowboy
Report-To: {"group":"heroku-nel","max_age":3600,"endpoints":[{"url":"https://nel.heroku.com/reports?ts=1733972948&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=zw0brHIG0M6uccXv2WLL%2BtA5tT6yhHamZVidbxleGK8%3D"}]}
Reporting-Endpoints: heroku-nel=https://nel.heroku.com/reports?ts=1733972948&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=zw0brHIG0M6uccXv2WLL%2BtA5tT6yhHamZVidbxleGK8%3D
Nel: {"report_to":"heroku-nel","max_age":3600,"success_fraction":0.005,"failure_fraction":0.05,"response_headers":["Via"]}
Connection: keep-alive
X-Powered-By: Express
Access-Control-Allow-Origin: *
X-Ratelimit-Limit: 50
X-Ratelimit-Remaining: 49
Date: Thu, 12 Dec 2024 03:09:08 GMT
X-Ratelimit-Reset: 1733972950
Content-Type: application/json; charset=utf-8
Content-Length: 1101
Etag: W/"44d-JsgqPaBdjo6Y5CzjgKr5c8BZ4nw"
Via: 1.1 vegur

{
  "index": "bane",
  "name": "Bane",
  "desc": [
    "Up to three creatures of your choice that you can see within range must make charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or a saving throw before the spell ends, the target must roll a d4 and subtract the number rolled from the attack roll or saving throw."
  ],
  "higher_level": [
    "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st."
  ],
  "range": "30 feet",
  "components": [
    "V",
    "S",
    "M"
  ],
  "material": "A drop of blood.",
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 1,
  "dc": {
    "dc_type": {
      "index": "cha",
      "name": "CHA",
      "url": "/api/ability-scores/cha"
    },
    "dc_success": "none"
  },
  "school": {
    "index": "enchantment",
    "name": "Enchantment",
    "url": "/api/magic-schools/enchantment"
  },
  "classes": [
    {
      "index": "bard",
      "name": "Bard",
      "url": "/api/classes/bard"
    },
    {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/classes/cleric"
    }
  ],
  "subclasses": [
    {
      "index": "lore",
      "name": "Lore",
      "url": "/api/subclasses/lore"
    }
  ],
  "url": "/api/spells/bane"
}
#+end_example

**** Divine favor

#+begin_src verb :op send
get divine-favor
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Server: Cowboy
Report-To: {"group":"heroku-nel","max_age":3600,"endpoints":[{"url":"https://nel.heroku.com/reports?ts=1733973419&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=bdBp%2BgMuaojo0qiMyW66mQ92fFi9aHftAi2N%2FtfcibI%3D"}]}
Reporting-Endpoints: heroku-nel=https://nel.heroku.com/reports?ts=1733973419&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=bdBp%2BgMuaojo0qiMyW66mQ92fFi9aHftAi2N%2FtfcibI%3D
Nel: {"report_to":"heroku-nel","max_age":3600,"success_fraction":0.005,"failure_fraction":0.05,"response_headers":["Via"]}
Connection: keep-alive
X-Powered-By: Express
Access-Control-Allow-Origin: *
X-Ratelimit-Limit: 50
X-Ratelimit-Remaining: 49
Date: Thu, 12 Dec 2024 03:16:59 GMT
X-Ratelimit-Reset: 1733973421
Content-Type: application/json; charset=utf-8
Content-Length: 755
Etag: W/"2f3-U4CTAHqQutZZUgBpIrSCf685Q4U"
Via: 1.1 vegur

{
  "higher_level": [],
  "index": "divine-favor",
  "name": "Divine Favor",
  "desc": [
    "Your prayer empowers you with divine radiance. Until the spell ends, your weapon attacks deal an extra 1d4 radiant damage on a hit."
  ],
  "range": "Self",
  "components": [
    "V",
    "S"
  ],
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 bonus action",
  "level": 1,
  "damage": {
    "damage_type": {
      "index": "radiant",
      "name": "Radiant",
      "url": "/api/damage-types/radiant"
    },
    "damage_at_slot_level": {
      "1": "1d4"
    }
  },
  "school": {
    "index": "evocation",
    "name": "Evocation",
    "url": "/api/magic-schools/evocation"
  },
  "classes": [
    {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/classes/paladin"
    }
  ],
  "subclasses": [
    {
      "index": "lore",
      "name": "Lore",
      "url": "/api/subclasses/lore"
    }
  ],
  "url": "/api/spells/divine-favor"
}
#+end_example

**** Inflict wounds

#+begin_src verb :op send
get inflict-wounds
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Server: Cowboy
Report-To: {"group":"heroku-nel","max_age":3600,"endpoints":[{"url":"https://nel.heroku.com/reports?ts=1733973209&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=4A0%2BGy%2BPavXMkBxwD4A2f1mOY7Hhkzz5mGmUiooqen4%3D"}]}
Reporting-Endpoints: heroku-nel=https://nel.heroku.com/reports?ts=1733973209&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=4A0%2BGy%2BPavXMkBxwD4A2f1mOY7Hhkzz5mGmUiooqen4%3D
Nel: {"report_to":"heroku-nel","max_age":3600,"success_fraction":0.005,"failure_fraction":0.05,"response_headers":["Via"]}
Connection: keep-alive
X-Powered-By: Express
Access-Control-Allow-Origin: *
X-Ratelimit-Limit: 50
X-Ratelimit-Remaining: 49
Date: Thu, 12 Dec 2024 03:13:29 GMT
X-Ratelimit-Reset: 1733973211
Content-Type: application/json; charset=utf-8
Content-Length: 978
Etag: W/"3d2-ciqE9nYUsckbB6wrMqI9kpqPiMs"
Via: 1.1 vegur

{
  "index": "inflict-wounds",
  "name": "Inflict Wounds",
  "desc": [
    "Make a melee spell attack against a creature you can reach. On a hit, the target takes 3d10 necrotic damage."
  ],
  "higher_level": [
    "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d10 for each slot level above 1st."
  ],
  "range": "Touch",
  "components": [
    "V",
    "S"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 action",
  "level": 1,
  "attack_type": "melee",
  "damage": {
    "damage_type": {
      "index": "necrotic",
      "name": "Necrotic",
      "url": "/api/damage-types/necrotic"
    },
    "damage_at_slot_level": {
      "1": "3d10",
      "2": "4d10",
      "3": "5d10",
      "4": "6d10",
      "5": "7d10",
      "6": "8d10",
      "7": "9d10",
      "8": "10d10",
      "9": "11d10"
    }
  },
  "school": {
    "index": "necromancy",
    "name": "Necromancy",
    "url": "/api/magic-schools/necromancy"
  },
  "classes": [
    {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/classes/cleric"
    }
  ],
  "subclasses": [
    {
      "index": "lore",
      "name": "Lore",
      "url": "/api/subclasses/lore"
    }
  ],
  "url": "/api/spells/inflict-wounds"
}
#+end_example

**** Guiding bolt

#+begin_src verb :op send
get guiding-bolt
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Server: Cowboy
Report-To: {"group":"heroku-nel","max_age":3600,"endpoints":[{"url":"https://nel.heroku.com/reports?ts=1733973236&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=AEz7W33I6Htwd00cRhKCcV0b0S6qSIhfnHRwaagu3xA%3D"}]}
Reporting-Endpoints: heroku-nel=https://nel.heroku.com/reports?ts=1733973236&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=AEz7W33I6Htwd00cRhKCcV0b0S6qSIhfnHRwaagu3xA%3D
Nel: {"report_to":"heroku-nel","max_age":3600,"success_fraction":0.005,"failure_fraction":0.05,"response_headers":["Via"]}
Connection: keep-alive
X-Powered-By: Express
Access-Control-Allow-Origin: *
X-Ratelimit-Limit: 50
X-Ratelimit-Remaining: 49
Date: Thu, 12 Dec 2024 03:13:56 GMT
X-Ratelimit-Reset: 1733973238
Content-Type: application/json; charset=utf-8
Content-Length: 1180
Etag: W/"49c-iJnrU9/7wY7R6DtLlPHMg2P+xW4"
Via: 1.1 vegur

{
  "index": "guiding-bolt",
  "name": "Guiding Bolt",
  "desc": [
    "A flash of light streaks toward a creature of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 4d6 radiant damage, and the next attack roll made against this target before the end of your next turn has advantage, thanks to the mystical dim light glittering on the target until then."
  ],
  "higher_level": [
    "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st."
  ],
  "range": "120 feet",
  "components": [
    "V",
    "S"
  ],
  "ritual": false,
  "duration": "1 round",
  "concentration": false,
  "casting_time": "1 action",
  "level": 1,
  "attack_type": "ranged",
  "damage": {
    "damage_type": {
      "index": "radiant",
      "name": "Radiant",
      "url": "/api/damage-types/radiant"
    },
    "damage_at_slot_level": {
      "1": "4d6",
      "2": "5d6",
      "3": "6d6",
      "4": "7d6",
      "5": "8d6",
      "6": "9d6",
      "7": "10d6",
      "8": "11d6",
      "9": "12d6"
    }
  },
  "school": {
    "index": "evocation",
    "name": "Evocation",
    "url": "/api/magic-schools/evocation"
  },
  "classes": [
    {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/classes/cleric"
    }
  ],
  "subclasses": [
    {
      "index": "lore",
      "name": "Lore",
      "url": "/api/subclasses/lore"
    }
  ],
  "url": "/api/spells/guiding-bolt"
}
#+end_example

**** Healing word

#+begin_src verb :op send
get healing-word
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Server: Cowboy
Report-To: {"group":"heroku-nel","max_age":3600,"endpoints":[{"url":"https://nel.heroku.com/reports?ts=1733973620&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=85hXOOiuY%2BQYZ%2FSLR0zXDdZnXeIBvSbFSXsyr2Z6vFE%3D"}]}
Reporting-Endpoints: heroku-nel=https://nel.heroku.com/reports?ts=1733973620&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=85hXOOiuY%2BQYZ%2FSLR0zXDdZnXeIBvSbFSXsyr2Z6vFE%3D
Nel: {"report_to":"heroku-nel","max_age":3600,"success_fraction":0.005,"failure_fraction":0.05,"response_headers":["Via"]}
Connection: keep-alive
X-Powered-By: Express
Access-Control-Allow-Origin: *
X-Ratelimit-Limit: 50
X-Ratelimit-Remaining: 49
Date: Thu, 12 Dec 2024 03:20:20 GMT
X-Ratelimit-Reset: 1733973622
Content-Type: application/json; charset=utf-8
Content-Length: 1077
Etag: W/"435-zlXBK7vBF/auD7ZCoqDA8UrdldM"
Via: 1.1 vegur

{
  "index": "healing-word",
  "name": "Healing Word",
  "desc": [
    "A creature of your choice that you can see within range regains hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs."
  ],
  "higher_level": [
    "When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d4 for each slot level above 1st."
  ],
  "range": "60 feet",
  "components": [
    "V"
  ],
  "ritual": false,
  "duration": "Instantaneous",
  "concentration": false,
  "casting_time": "1 bonus action",
  "level": 1,
  "heal_at_slot_level": {
    "1": "1d4 + MOD",
    "2": "2d4 + MOD",
    "3": "3d4 + MOD",
    "4": "4d4 + MOD",
    "5": "5d4 + MOD",
    "6": "6d4 + MOD",
    "7": "7d4 + MOD",
    "8": "8d4 + MOD",
    "9": "9d4 + MOD"
  },
  "school": {
    "index": "evocation",
    "name": "Evocation",
    "url": "/api/magic-schools/evocation"
  },
  "classes": [
    {
      "index": "bard",
      "name": "Bard",
      "url": "/api/classes/bard"
    },
    {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/classes/cleric"
    },
    {
      "index": "druid",
      "name": "Druid",
      "url": "/api/classes/druid"
    }
  ],
  "subclasses": [
    {
      "index": "lore",
      "name": "Lore",
      "url": "/api/subclasses/lore"
    }
  ],
  "url": "/api/spells/healing-word"
}
#+end_example

**** Shield of faith

#+begin_src verb :op send
get shield-of-faith
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Server: Cowboy
Report-To: {"group":"heroku-nel","max_age":3600,"endpoints":[{"url":"https://nel.heroku.com/reports?ts=1733973599&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=eLuwxnpd0rP%2BA%2Br1g6Dvpl6y88bKag7nazFMRoG5nBg%3D"}]}
Reporting-Endpoints: heroku-nel=https://nel.heroku.com/reports?ts=1733973599&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=eLuwxnpd0rP%2BA%2Br1g6Dvpl6y88bKag7nazFMRoG5nBg%3D
Nel: {"report_to":"heroku-nel","max_age":3600,"success_fraction":0.005,"failure_fraction":0.05,"response_headers":["Via"]}
Connection: keep-alive
X-Powered-By: Express
Access-Control-Allow-Origin: *
X-Ratelimit-Limit: 50
X-Ratelimit-Remaining: 49
Date: Thu, 12 Dec 2024 03:19:59 GMT
X-Ratelimit-Reset: 1733973601
Content-Type: application/json; charset=utf-8
Content-Length: 774
Etag: W/"306-psvKO8WD6Z9sGjgIjlNLADYeNrA"
Via: 1.1 vegur

{
  "higher_level": [],
  "index": "shield-of-faith",
  "name": "Shield of Faith",
  "desc": [
    "A shimmering field appears and surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration."
  ],
  "range": "60 feet",
  "components": [
    "V",
    "S",
    "M"
  ],
  "material": "A small parchment with a bit of holy text written on it.",
  "ritual": false,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "1 bonus action",
  "level": 1,
  "school": {
    "index": "abjuration",
    "name": "Abjuration",
    "url": "/api/magic-schools/abjuration"
  },
  "classes": [
    {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/classes/cleric"
    },
    {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/classes/paladin"
    }
  ],
  "subclasses": [
    {
      "index": "lore",
      "name": "Lore",
      "url": "/api/subclasses/lore"
    }
  ],
  "url": "/api/spells/shield-of-faith"
}
#+end_example

**** Spiritual Weapon

#+begin_src verb :op send
get spiritual-weapon
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Server: Cowboy
Report-To: {"group":"heroku-nel","max_age":3600,"endpoints":[{"url":"https://nel.heroku.com/reports?ts=1733973009&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=SwPztUy9glxDi8751LDjnP6aqQrY5hRC0LXEW8IR2Ec%3D"}]}
Reporting-Endpoints: heroku-nel=https://nel.heroku.com/reports?ts=1733973009&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=SwPztUy9glxDi8751LDjnP6aqQrY5hRC0LXEW8IR2Ec%3D
Nel: {"report_to":"heroku-nel","max_age":3600,"success_fraction":0.005,"failure_fraction":0.05,"response_headers":["Via"]}
Connection: keep-alive
X-Powered-By: Express
Access-Control-Allow-Origin: *
X-Ratelimit-Limit: 50
X-Ratelimit-Remaining: 49
Date: Thu, 12 Dec 2024 03:10:09 GMT
X-Ratelimit-Reset: 1733973011
Content-Type: application/json; charset=utf-8
Content-Length: 1632
Etag: W/"660-oDe0UnVeTYPsTGdmY3aBBRDEe5g"
Via: 1.1 vegur

{
  "index": "spiritual-weapon",
  "name": "Spiritual Weapon",
  "desc": [
    "You create a floating, spectral weapon within range that lasts for the duration or until you cast this spell again. When you cast the spell, you can make a melee spell attack against a creature within 5 feet of the weapon. On a hit, the target takes force damage equal to 1d8 + your spellcasting ability modifier.",
    "As a bonus action on your turn, you can move the weapon up to 20 feet and repeat the attack against a creature within 5 feet of it.",
    "The weapon can take whatever form you choose. Clerics of deities who are associated with a particular weapon (as St. Cuthbert is known for his mace and Thor for his hammer) make this spell's effect resemble that weapon."
  ],
  "higher_level": [
    "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for every two slot levels above the 2nd."
  ],
  "range": "60 feet",
  "components": [
    "V",
    "S"
  ],
  "ritual": false,
  "duration": "1 minute",
  "concentration": false,
  "casting_time": "1 bonus action",
  "level": 2,
  "attack_type": "melee",
  "damage": {
    "damage_type": {
      "index": "force",
      "name": "Force",
      "url": "/api/damage-types/force"
    },
    "damage_at_slot_level": {
      "2": "1d8 + MOD",
      "3": "1d8 + MOD",
      "4": "2d8 + MOD",
      "5": "2d8 + MOD",
      "6": "3d8 + MOD",
      "7": "3d8 + MOD",
      "8": "4d8 + MOD",
      "9": "4d8 + MOD"
    }
  },
  "school": {
    "index": "evocation",
    "name": "Evocation",
    "url": "/api/magic-schools/evocation"
  },
  "classes": [
    {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/classes/cleric"
    }
  ],
  "subclasses": [
    {
      "index": "lore",
      "name": "Lore",
      "url": "/api/subclasses/lore"
    },
    {
      "index": "life",
      "name": "Life",
      "url": "/api/subclasses/life"
    }
  ],
  "url": "/api/spells/spiritual-weapon"
}
#+end_example

*** 2nd level

**** Aid

#+begin_src verb :op send
get aid
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Server: Cowboy
Report-To: {"group":"heroku-nel","max_age":3600,"endpoints":[{"url":"https://nel.heroku.com/reports?ts=1733973737&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=aYuHXtugWr78fWh9ih%2FI7XQ2ej1Yy53%2FnjPp1LbDR8I%3D"}]}
Reporting-Endpoints: heroku-nel=https://nel.heroku.com/reports?ts=1733973737&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=aYuHXtugWr78fWh9ih%2FI7XQ2ej1Yy53%2FnjPp1LbDR8I%3D
Nel: {"report_to":"heroku-nel","max_age":3600,"success_fraction":0.005,"failure_fraction":0.05,"response_headers":["Via"]}
Connection: keep-alive
X-Powered-By: Express
Access-Control-Allow-Origin: *
X-Ratelimit-Limit: 50
X-Ratelimit-Remaining: 49
Date: Thu, 12 Dec 2024 03:22:17 GMT
X-Ratelimit-Reset: 1733973739
Content-Type: application/json; charset=utf-8
Content-Length: 1002
Etag: W/"3ea-MbhD27pwk91YiozzNQdwM4ntKR0"
Via: 1.1 vegur

{
  "index": "aid",
  "name": "Aid",
  "desc": [
    "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration."
  ],
  "higher_level": [
    "When you cast this spell using a spell slot of 3rd level or higher, a target's hit points increase by an additional 5 for each slot level above 2nd."
  ],
  "range": "30 feet",
  "components": [
    "V",
    "S",
    "M"
  ],
  "material": "A tiny strip of white cloth.",
  "ritual": false,
  "duration": "8 hours",
  "concentration": false,
  "casting_time": "1 action",
  "level": 2,
  "heal_at_slot_level": {
    "2": "5",
    "3": "10",
    "4": "15",
    "5": "20",
    "6": "25",
    "7": "30",
    "8": "35",
    "9": "40"
  },
  "school": {
    "index": "abjuration",
    "name": "Abjuration",
    "url": "/api/magic-schools/abjuration"
  },
  "classes": [
    {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/classes/cleric"
    },
    {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/classes/paladin"
    }
  ],
  "subclasses": [
    {
      "index": "lore",
      "name": "Lore",
      "url": "/api/subclasses/lore"
    }
  ],
  "url": "/api/spells/aid"
}
#+end_example

**** Calm emotions

#+begin_src verb :op send
get calm-emotions
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Server: Cowboy
Report-To: {"group":"heroku-nel","max_age":3600,"endpoints":[{"url":"https://nel.heroku.com/reports?ts=1733973767&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=lmPQOD6m660wlqq%2BnKvlmOf5gYfl5Hg9KAqNrvAAaQs%3D"}]}
Reporting-Endpoints: heroku-nel=https://nel.heroku.com/reports?ts=1733973767&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=lmPQOD6m660wlqq%2BnKvlmOf5gYfl5Hg9KAqNrvAAaQs%3D
Nel: {"report_to":"heroku-nel","max_age":3600,"success_fraction":0.005,"failure_fraction":0.05,"response_headers":["Via"]}
Connection: keep-alive
X-Powered-By: Express
Access-Control-Allow-Origin: *
X-Ratelimit-Limit: 50
X-Ratelimit-Remaining: 49
Date: Thu, 12 Dec 2024 03:22:47 GMT
X-Ratelimit-Reset: 1733973769
Content-Type: application/json; charset=utf-8
Content-Length: 1524
Etag: W/"5f4-jMo9yzOFQxbO6eiwdxr2boTkSTo"
Via: 1.1 vegur

{
  "higher_level": [],
  "index": "calm-emotions",
  "name": "Calm Emotions",
  "desc": [
    "You attempt to suppress strong emotions in a group of people. Each humanoid in a 20-foot-radius sphere centered on a point you choose within range must make a charisma saving throw; a creature can choose to fail this saving throw if it wishes. If a creature fails its saving throw, choose one of the following two effects. You can suppress any effect causing a target to be charmed or frightened. When this spell ends, any suppressed effect resumes, provided that its duration has not expired in the meantime.",
    "Alternatively, you can make a target indifferent about creatures of your choice that it is hostile toward. This indifference ends if the target is attacked or harmed by a spell or if it witnesses any of its friends being harmed. When the spell ends, the creature becomes hostile again, unless the GM rules otherwise."
  ],
  "range": "60 feet",
  "components": [
    "V",
    "S"
  ],
  "ritual": false,
  "duration": "Up to 1 minute",
  "concentration": true,
  "casting_time": "1 action",
  "level": 2,
  "dc": {
    "dc_type": {
      "index": "cha",
      "name": "CHA",
      "url": "/api/ability-scores/cha"
    },
    "dc_success": "none"
  },
  "area_of_effect": {
    "type": "sphere",
    "size": 20
  },
  "school": {
    "index": "enchantment",
    "name": "Enchantment",
    "url": "/api/magic-schools/enchantment"
  },
  "classes": [
    {
      "index": "bard",
      "name": "Bard",
      "url": "/api/classes/bard"
    },
    {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/classes/cleric"
    }
  ],
  "subclasses": [
    {
      "index": "lore",
      "name": "Lore",
      "url": "/api/subclasses/lore"
    }
  ],
  "url": "/api/spells/calm-emotions"
}
#+end_example

**** Locate object

#+begin_src verb :op send
get locate-object
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Server: Cowboy
Report-To: {"group":"heroku-nel","max_age":3600,"endpoints":[{"url":"https://nel.heroku.com/reports?ts=1733973797&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=l6QyuPvo5gPTswwIj6o3%2Bp%2B4j4OjV4QFK1Vy87NGWGY%3D"}]}
Reporting-Endpoints: heroku-nel=https://nel.heroku.com/reports?ts=1733973797&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=l6QyuPvo5gPTswwIj6o3%2Bp%2B4j4OjV4QFK1Vy87NGWGY%3D
Nel: {"report_to":"heroku-nel","max_age":3600,"success_fraction":0.005,"failure_fraction":0.05,"response_headers":["Via"]}
Connection: keep-alive
X-Powered-By: Express
Access-Control-Allow-Origin: *
X-Ratelimit-Limit: 50
X-Ratelimit-Remaining: 49
Date: Thu, 12 Dec 2024 03:23:17 GMT
X-Ratelimit-Reset: 1733973799
Content-Type: application/json; charset=utf-8
Content-Length: 1457
Etag: W/"5b1-Sfe1Ae4NLZPbv876hmC3JW64B3I"
Via: 1.1 vegur

{
  "higher_level": [],
  "index": "locate-object",
  "name": "Locate Object",
  "desc": [
    "Describe or name an object that is familiar to you. You sense the direction to the object's location, as long as that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement.",
    "The spell can locate a specific object known to you, as long as you have seen it up close--within 30 feet--at least once. Alternatively, the spell can locate the nearest object of a particular kind, such as a certain kind of apparel, jewelry, furniture, tool, or weapon.",
    "This spell can't locate an object if any thickness of lead, even a thin sheet, blocks a direct path between you and the object."
  ],
  "range": "Self",
  "components": [
    "V",
    "S",
    "M"
  ],
  "material": "A forked twig.",
  "ritual": false,
  "duration": "Up to 10 minutes",
  "concentration": true,
  "casting_time": "1 action",
  "level": 2,
  "school": {
    "index": "divination",
    "name": "Divination",
    "url": "/api/magic-schools/divination"
  },
  "classes": [
    {
      "index": "bard",
      "name": "Bard",
      "url": "/api/classes/bard"
    },
    {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/classes/cleric"
    },
    {
      "index": "druid",
      "name": "Druid",
      "url": "/api/classes/druid"
    },
    {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/classes/paladin"
    },
    {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/classes/ranger"
    },
    {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/classes/wizard"
    }
  ],
  "subclasses": [
    {
      "index": "lore",
      "name": "Lore",
      "url": "/api/subclasses/lore"
    }
  ],
  "url": "/api/spells/locate-object"
}
#+end_example

**** Magic weapon

#+begin_src verb :op send
get magic-weapon
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Server: Cowboy
Report-To: {"group":"heroku-nel","max_age":3600,"endpoints":[{"url":"https://nel.heroku.com/reports?ts=1733973654&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=yjVUhOH7XQjd6ERgV7OsU3jPxxA7W5CtmtrzHV0jfmY%3D"}]}
Reporting-Endpoints: heroku-nel=https://nel.heroku.com/reports?ts=1733973654&sid=1b10b0ff-8a76-4548-befa-353fc6c6c045&s=yjVUhOH7XQjd6ERgV7OsU3jPxxA7W5CtmtrzHV0jfmY%3D
Nel: {"report_to":"heroku-nel","max_age":3600,"success_fraction":0.005,"failure_fraction":0.05,"response_headers":["Via"]}
Connection: keep-alive
X-Powered-By: Express
Access-Control-Allow-Origin: *
X-Ratelimit-Limit: 50
X-Ratelimit-Remaining: 49
Date: Thu, 12 Dec 2024 03:20:54 GMT
X-Ratelimit-Reset: 1733973656
Content-Type: application/json; charset=utf-8
Content-Length: 877
Etag: W/"36d-ihYjT+o9db7M7vZvydsZtnXN2A0"
Via: 1.1 vegur

{
  "index": "magic-weapon",
  "name": "Magic Weapon",
  "desc": [
    "You touch a nonmagical weapon. Until the spell ends, that weapon becomes a magic weapon with a +1 bonus to attack rolls and damage rolls."
  ],
  "higher_level": [
    "When you cast this spell using a spell slot of 4th level or higher, the bonus increases to +2. When you use a spell slot of 6th level or higher, the bonus increases to +3."
  ],
  "range": "Touch",
  "components": [
    "V",
    "S"
  ],
  "ritual": false,
  "duration": "Up to 1 hour",
  "concentration": true,
  "casting_time": "1 bonus action",
  "level": 2,
  "school": {
    "index": "transmutation",
    "name": "Transmutation",
    "url": "/api/magic-schools/transmutation"
  },
  "classes": [
    {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/classes/paladin"
    },
    {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/classes/wizard"
    }
  ],
  "subclasses": [
    {
      "index": "lore",
      "name": "Lore",
      "url": "/api/subclasses/lore"
    }
  ],
  "url": "/api/spells/magic-weapon"
}
#+end_example

**** Spiritual weapon

* Postamble

# Local Variables:
# eval: (verb-mode)
# End:
